SELECT [ПОСТАВКИ НА СКЛАД].[Код поставщика], [ПОСТАВКИ НА СКЛАД].[Наименование детали], ПОСТАВЩИКИ.Название
FROM     [ПОСТАВКИ НА СКЛАД] INNER JOIN
                  ПОСТАВЩИКИ ON [ПОСТАВКИ НА СКЛАД].[Код поставщика] = ПОСТАВЩИКИ.Код
WHERE  ([ПОСТАВКИ НА СКЛАД].[Код поставщика] = N'11002233')SELECT [ПОСТАВКИ НА СКЛАД].[Дата поставки], [ПОСТАВКИ НА СКЛАД].[Наименование детали], ПОСТАВЩИКИ.Название
FROM     [ПОСТАВКИ НА СКЛАД] INNER JOIN
                  ПОСТАВЩИКИ ON [ПОСТАВКИ НА СКЛАД].[Код поставщика] = ПОСТАВЩИКИ.Код
WHERE  ([ПОСТАВКИ НА СКЛАД].[Дата поставки] < CONVERT(DATETIME, '2022-10-10 00:00:00', 102))